JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.c
/*
 * Copyright 2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_netc_switch.h"

/*! @name NETC register map. */
/*@{*/
#define NETC_SWT_PORT_GROUP_BASE_OFFSET (0x4000U)  /*!< The Switch port group register base address offset. */
#define NETC_SWT_GLOBAL_BASE_OFFSET     (0x80000U) /*!< The Switch global register base address offset. */
#define NETC_SWT_PCIE_FUNC_OFFSET       (2U)       /*!< The Switch function register base address offset. */

/*! @brief Pointers to netc bases for each instance. */
static ENETC_PCI_TYPE0_Type *const s_netcPciBases[] = ENETC_PCI_TYPE0_BASE_PTRS;

/*! @brief Pointers to netc bases for each instance. */
static NETC_SW_Type *const s_netcSWBases[] = NETC_SW_BASE_PTRS;

/*! @brief Common message data buffer for command ring 0 and ring 1, data buffer address need align with 16 bytes */
AT_NONCACHEABLE_SECTION_ALIGN(static netc_tb_data_buffer_t dataBuffer0, 16);
AT_NONCACHEABLE_SECTION_ALIGN(static netc_tb_data_buffer_t dataBuffer1, 16);
static netc_tb_data_buffer_t *s_cmdDataBuffer[2] = {&dataBuffer0, &dataBuffer1};
/*!< Management ENETC SI 0 Rx ring hardware index, this ring is only used for receive frames with Host Reason filed not
 * zero. */
static uint8_t mgmtRxBdRingIdx;

static void SWT_GetBaseResource(swt_handle_t *handle, netc_hw_switch_idx_t sw)
{
    handle->hw.func   = s_netcPciBases[NETC_SWT_PCIE_FUNC_OFFSET + (uint32_t)sw];
    handle->hw.base   = s_netcSWBases[sw];
    handle->hw.common = (NETC_SW_ENETC_Type *)((uintptr_t)handle->hw.base);
    handle->hw.global = (ENETC_GLOBAL_Type *)((uintptr_t)handle->hw.base + NETC_SWT_GLOBAL_BASE_OFFSET);
    for (uint32_t i = 0U; i < (uint32_t)FSL_FEATURE_NETC_SWITCH_MAX_PORT_NUMBER; i++)
    {
        handle->hw.ports[i].port =
            (NETC_PORT_Type *)((uintptr_t)handle->hw.base + (i + 1U) * NETC_SWT_PORT_GROUP_BASE_OFFSET);
        handle->hw.ports[i].eth =
            (NETC_ETH_LINK_Type *)((uintptr_t)handle->hw.base + (i + 1U) * NETC_SWT_PORT_GROUP_BASE_OFFSET);
    }
    handle->hw.msixTable = (netc_msix_entry_t *)(FSL_FEATURE_NETC_MSIX_TABLE_BASE +
                                                 NETC_MSIX_TABLE_OFFSET * (NETC_SWT_PCIE_FUNC_OFFSET + (uint32_t)sw));
}

/*!
 * @brief Set the MSIX entry table
 *
 * This function is to set entry table in specified MSIX Table memory. After entry table setup, set interrupts
 * vector/entry index.
 *
 * @param handle  The SWT handle.
 * @param config  The SWT configuration.
 * @return status_t
 */
static status_t SWT_MSIXSetEntryTable(swt_handle_t *handle, const swt_config_t *config)
{
    uint32_t *msixTable  = (uint32_t *)(uintptr_t)handle->hw.msixTable;
    uint32_t *entryTable = (uint32_t *)(uintptr_t)config->msixEntry;
    uint8_t msixNum;

    msixNum =
        (uint8_t)(((handle->hw.base->SCAPR0 & NETC_SW_SCAPR0_NUM_MSIX_MASK) >> NETC_SW_SCAPR0_NUM_MSIX_SHIFT) + 1U);

    /* Entry > 0, enable MSIX. */
    if (config->entryNum != 0U)
    {
        if (config->entryNum > msixNum)
        {
            return kStatus_InvalidArgument;
        }

        if (MAX(MAX(config->cmdBdrEntryIdx[0], config->cmdBdrEntryIdx[1]), config->timeCaptureEntryIdx) >=
            config->entryNum)
        {
            return kStatus_InvalidArgument;
        }

        /* Use 32-bit access to set MSIX table. */
        for (uint32_t i = 0; i < config->entryNum; i++)
        {
            msixTable[i * 4U]      = entryTable[i * 4U];
            msixTable[i * 4U + 1U] = entryTable[i * 4U + 1U];
            msixTable[i * 4U + 2U] = entryTable[i * 4U + 2U];
            msixTable[i * 4U + 3U] = entryTable[i * 4U + 3U];
        }

        /* Set MSIX entry index. */
        handle->hw.base->NUM_CBDR_INT[0].CBDRMSIVR =
            (uint32_t)config->cmdBdrEntryIdx[0] & NETC_SW_CBDRMSIVR_VECTOR_MASK;
        handle->hw.base->NUM_CBDR_INT[1].CBDRMSIVR =
            (uint32_t)config->cmdBdrEntryIdx[1] & NETC_SW_CBDRMSIVR_VECTOR_MASK;
        handle->hw.common->TCMSIVR = (uint32_t)config->timeCaptureEntryIdx & NETC_SW_ENETC_TCMSIVR_VECTOR_MASK;

        /* Enable MSIX. */
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL = ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK;
    }
    else
    {
        /* Disable MSIX. */
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL = ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
    }

    return kStatus_Success;
}

status_t SWT_MsixSetGlobalMask(swt_handle_t *handle, bool mask)
{
    if (mask)
    {
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL |= ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
    }
    else
    {
        handle->hw.func->PCI_CFC_MSIX_MSG_CTL &= (uint16_t)(~ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK);
    }

    return kStatus_Success;
}

status_t SWT_MsixSetEntryMask(swt_handle_t *handle, uint8_t entryIdx, bool mask)
{
    status_t result;

    if (entryIdx < handle->cfg.entryNum)
    {
        handle->hw.msixTable[entryIdx].control = (uint32_t)mask;
        result                                 = kStatus_Success;
    }
    else
    {
        result = kStatus_Fail;
    }

    return result;
}

status_t SWT_MsixGetPendingStatus(swt_handle_t *handle, uint8_t pbaIdx, uint64_t *status)
{
    status_t result = kStatus_Success;
    bool funcEnable;

    if (handle->cfg.entryNum == 0U)
    {
        return kStatus_Fail;
    }

    /* Check MSIX enable status. */
    funcEnable = ((handle->hw.func->PCI_CFC_MSIX_MSG_CTL & ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK) != 0U);

    if (funcEnable)
    {
        if (pbaIdx <= ((handle->cfg.entryNum - 1U) / 64U))
        {
            *status = *(uint64_t *)((uintptr_t)handle->hw.msixTable + NETC_MSIX_TABLE_PBA_OFFSET + 8U * pbaIdx);
            result  = kStatus_Success;
        }
        else
        {
            result = kStatus_InvalidArgument;
        }
    }
    else
    {
        *status = 0;
        result  = kStatus_Fail;
    }

    return result;
}

status_t SWT_GetDefaultConfig(swt_config_t *config)
{
    assert(config != NULL);

    (void)memset(config, 0, sizeof(swt_config_t));
    for (uint32_t i = 0U; i < 5U; i++)
    {
        config->ports[i].bridgeCfg.acceptUntag          = true;
        config->ports[i].bridgeCfg.acceptPriorityTag    = true;
        config->ports[i].bridgeCfg.acceptSingleTag      = true;
        config->ports[i].bridgeCfg.acceptDoubleTag      = true;
        config->ports[i].bridgeCfg.enSrcPortPrun        = true;
        config->ports[i].bridgeCfg.stgMode[0]           = kNETC_ForwardFrame;
        config->ports[i].isiCfg.defaultISEID            = 0xFFFFU;
        config->ports[i].commonCfg.acceptTpid.innerMask = (uint8_t)kNETC_OuterStanCvlan | (uint8_t)kNETC_OuterStanSvlan;
        config->ports[i].commonCfg.acceptTpid.outerMask = (uint8_t)kNETC_InnerStanCvlan | (uint8_t)kNETC_InnerStanSvlan;
        config->ports[i].commonCfg.pSpeed               = 0x63U;
        config->ports[i].commonCfg.rxTsSelect           = kNETC_SyncTime;
        config->ports[i].commonCfg.stompFcs             = true;
        config->ports[i].commonCfg.rxPpduBco            = 20U;
        config->ports[i].commonCfg.txPpduBco            = 20U;
        config->ports[i].commonCfg.timeGate.holdSkew    = 64;
        config->ports[i].ethMac.preemptMode             = kNETC_PreemptDisable;
        config->ports[i].ethMac.enMergeVerify           = false;
        config->ports[i].ethMac.mergeVerifyTime         = 10U;
        config->ports[i].ethMac.enTxPad                 = true;
        config->ports[i].ethMac.rxMinFrameSize          = 64U;
        config->ports[i].ethMac.rxMaxFrameSize          = 0x600U;
        config->ports[i].enTxRx                         = true;
        for (uint32_t j = 0U; j < 8U; j++)
        {
            config->ports[i].txTcCfg[j].sduCfg.maxSduSized = 0x600U;
            config->ports[i].txTcCfg[j].sduCfg.sduType     = kNETC_MPDU;
            config->ports[i].ipvToTC[j]                    = (uint8_t)j;
        }
    }
    for (uint32_t i = 0U; i < 2U; i++)
    {
        for (uint32_t j = 0U; j < 8U; j++)
        {
            config->rxqosCfg.profiles[i].ipv[j * 2U]      = (uint8_t)j;
            config->rxqosCfg.profiles[i].ipv[j * 2U + 1U] = (uint8_t)j;
            config->rxqosCfg.profiles[i].dr[j * 2U + 1U]  = 2U;
        }
    }
    config->bridgeCfg.dVFCfg.portMembership = 0x1FU;
    config->bridgeCfg.dVFCfg.mfo            = kNETC_FDBLookUpWithFlood;
    config->bridgeCfg.dVFCfg.mlo            = kNETC_HardwareMACLearn;
    config->imrCfg.enMirror                 = false;
    config->imrCfg.efmEntryID               = 0xFFFFU;

    return kStatus_Success;
}

/*!
 * @brief Free all Rx buffers
 *
 * @param handle  The Switch handle.
 */
static void SWT_RxBufferFreeAll(swt_handle_t *handle)
{
    netc_rx_bdr_t *rxBdRing;
    uint32_t maxHwBdNum;
    uint32_t index;

    if (handle->cfg.rxZeroCopy)
    {
        rxBdRing = &handle->mgmtRxBdRing;
        /* Hardware BD number means actual BD number in hardware view, two standard BDs act as one extended BD. */
        maxHwBdNum = rxBdRing->extendDesc ? (rxBdRing->len / 2U) : rxBdRing->len;

        for (index = 0U; index < maxHwBdNum; index++)
        {
            if (rxBdRing->buffArray[index] != 0U)
            {
                handle->cfg.rxBuffFree(handle, (void *)(uint8_t *)(uintptr_t)rxBdRing->buffArray[index],
                                       handle->cfg.userData);
            }
        }
    }
}

status_t SWT_Init(swt_handle_t *handle, const swt_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    status_t result = kStatus_Success;
    NETC_PORT_Type *port;

