JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.c
    (void)memset(handle, 0, sizeof(swt_handle_t));
    /* Get the register map resource for switch */
    SWT_GetBaseResource(handle, config->switchIdx);
    /* Enable master bus and memory access for PCIe and MSI-X first to do ETH MAC reset*/
    handle->hw.func->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
    /* Do software reset for all ETH MAC to clear Tx/Rx FIFO*/
    for (uint32_t i = 0U; (i < 5U) && (!NETC_PortIsPseudo(handle->hw.ports[i].port)); i++)
    {
        handle->hw.ports[i].port->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
        NETC_PortSoftwareResetEthMac(handle->hw.ports[i].eth);
    }
    /* Reset this function */
    handle->hw.func->PCI_CFC_PCIE_DEV_CTL |= ENETC_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK;
    while ((handle->hw.func->PCI_CFC_PCIE_DEV_CTL & ENETC_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK) != 0U)
    {
    }
    /* Enable master bus and memory access for PCIe and MSI-X */
    handle->hw.func->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051260) && FSL_FEATURE_NETC_HAS_ERRATA_051260)
    /* Errata 051260: All NETC functions need to be enabled for switch NTMP operation */
    NETC_F3_PCI_HDR_TYPE0->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
    NETC_F4_PCI_HDR_TYPE0->PCI_CFH_CMD |=
        (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);
#endif
    /* Store configuration in handle */
    handle->cfg.cmdRingUse = config->cmdRingUse;
    handle->cfg.entryNum   = config->entryNum;
    /* Store configuration in handle */
    result = SWT_MSIXSetEntryTable(handle, config);
    if (result != kStatus_Success)
    {
        return result;
    }
    /* Configure switch ingress mirror destination */
    if (kStatus_Success != SWT_RxMirrorConfig(handle, &config->imrCfg))
    {
        return kStatus_Fail;
    }
    /* Configure switch FDB hash table maximum number of  dynamically entries */
    handle->hw.base->FDBHTMCR = NETC_SW_FDBHTMCR_DYN_LIMIT(config->dynFDBLimit);
    /* Configure switch bridge */
    (void)SWT_BridgeInit(handle, &config->bridgeCfg);
    /* Configure switch command BD rings */
    for (uint32_t i = 0U; i < config->cmdRingUse; i++)
    {
        result = SWT_CmdBDRInit(handle, (netc_hw_swt_cbdr_idx_t)i, &config->cmdBdrCfg[i]);
        if (kStatus_Success != result)
        {
            return result;
        }
        handle->cmdBdRing[i].bdBase        = config->cmdBdrCfg[i].bdBase;
        handle->cmdBdRing[i].bdLength      = config->cmdBdrCfg[i].bdLength;
        handle->cmdBdRing[i].producerIndex = 0U;
        handle->cmdBdRing[i].cleanIndex    = 0U;
        handle->cmdBdRing[i].bdrEnable     = true;
    }
    /* Configure switch Ingress Port Filtering */
    (void)SWT_RxIPFInit(handle, &config->ipfCfg);
    /* Configure switch Ingress VLAN classification */
    (void)SWT_RxVlanCInit(handle, &config->vlanCfg);
    /* Configure switch Ingress QOS classification */
    (void)SWT_RxQosCInit(handle, &config->rxqosCfg);
    /* Configure switch egress QOS to VLAN map classification */
    (void)SWT_TxEPPQosToVlanConfig(handle, &config->txqosCfg);
    /* Configure switch PSFP */
    (void)SWT_RxPSFPInit(handle, &config->psfpCfg);
    /* Configure all ports and macs */
    for (uint32_t i = 0U; i < 5U; i++)
    {
        if (config->ports[i].enTxRx)
        {
            /* Config TGS on PSI side */
            result = SWT_TxPortTGSEnable(handle, (netc_hw_port_idx_t)i, config->ports[i].enableTg, 0xFFU);
            if (result != kStatus_Success)
            {
                return result;
            }
            port = handle->hw.ports[i].port;
            (void)SWT_BridgeConfigPort(handle, (netc_hw_port_idx_t)i, &config->ports[i].bridgeCfg);
            (void)SWT_FMConfigPort(handle, (netc_hw_port_idx_t)i, &config->ports[i].fmCfg);
            (void)NETC_PortSetISI(port, &config->ports[i].isiCfg);
            (void)NETC_PortConfig(port, &config->ports[i].commonCfg);
            port->PMCR      = NETC_PORT_PMCR_IMIRE(config->ports[i].enMirror);
            port->PLANIDCR  = NETC_PORT_PLANIDCR_LANID(config->ports[i].lanID);
            port->PIPV2QMR0 = NETC_PORT_PIPV2QMR0_IPV7_Q(config->ports[i].ipvToTC[7]) |
                              NETC_PORT_PIPV2QMR0_IPV6_Q(config->ports[i].ipvToTC[6]) |
                              NETC_PORT_PIPV2QMR0_IPV5_Q(config->ports[i].ipvToTC[5]) |
                              NETC_PORT_PIPV2QMR0_IPV4_Q(config->ports[i].ipvToTC[4]) |
                              NETC_PORT_PIPV2QMR0_IPV3_Q(config->ports[i].ipvToTC[3]) |
                              NETC_PORT_PIPV2QMR0_IPV2_Q(config->ports[i].ipvToTC[2]) |
                              NETC_PORT_PIPV2QMR0_IPV1_Q(config->ports[i].ipvToTC[1]) |
                              NETC_PORT_PIPV2QMR0_IPV0_Q(config->ports[i].ipvToTC[0]);
            port->PBPMCR0 = NETC_PORT_PBPMCR0_IPV3_INDEX(config->ports[i].ipvToBP[3]) |
                            NETC_PORT_PBPMCR0_IPV2_INDEX(config->ports[i].ipvToBP[2]) |
                            NETC_PORT_PBPMCR0_IPV1_INDEX(config->ports[i].ipvToBP[1]) |
                            NETC_PORT_PBPMCR0_IPV0_INDEX(config->ports[i].ipvToBP[0]);
            port->PBPMCR1 = NETC_PORT_PBPMCR1_IPV7_INDEX(config->ports[i].ipvToBP[7]) |
                            NETC_PORT_PBPMCR1_IPV6_INDEX(config->ports[i].ipvToBP[6]) |
                            NETC_PORT_PBPMCR1_IPV5_INDEX(config->ports[i].ipvToBP[5]) |
                            NETC_PORT_PBPMCR1_IPV4_INDEX(config->ports[i].ipvToBP[4]);
            /* Configure Ethernet MAC */
            if (!NETC_PortIsPseudo(port))
            {
                (void)NETC_PortConfigEthMac(handle->hw.ports[i].eth, &config->ports[i].ethMac);
                port->PCTFCR = NETC_PORT_PCTFCR_BSQS(config->ports[i].outBufferSize) |
                               NETC_PORT_PCTFCR_ECTS(!config->ports[i].outCutThrough) |
                               NETC_PORT_PCTFCR_ICTS(!config->ports[i].inCutThrough);
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051202) && FSL_FEATURE_NETC_HAS_ERRATA_051202)
                /* RT1180 errata 051202: Configure Tx MAC to wait until 32 bytes of data are built up in the transmit
                 * FIFO before beginning transmission on the link */
                *(volatile uint32_t *)((uintptr_t)handle->hw.ports[i].eth + 0x1020U) = 0x00010104;
                *(volatile uint32_t *)((uintptr_t)handle->hw.ports[i].eth + 0x1420U) = 0x00010104;
#endif
            }
            /* Configure traffic class */
            for (uint32_t j = 8U; j > 0U; j--)
            {
                result = SWT_TxTrafficClassConfig(handle, (netc_hw_port_idx_t)i, (netc_hw_tc_idx_t)(uint32_t)(j - 1U),
                                                  &config->ports[i].txTcCfg[(j - 1U)]);
                if (result != kStatus_Success)
                {
                    return result;
                }
            }
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
            /* Clear Tx/Rx disable to allow traffic to flow */
            handle->hw.ports[i].port->POR &= ~(NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
#endif
        }
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
        else
        {
            /* Disable the unused port Tx/Rx */
            handle->hw.ports[i].port->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
        }
#endif
    }
    return result;
}

status_t SWT_Deinit(swt_handle_t *handle)
{
    for (uint32_t i = 0U; i < handle->cfg.cmdRingUse; i++)
    {
        (void)SWT_CmdBDRDeinit(handle, (netc_hw_swt_cbdr_idx_t)i);
    }
    for (uint32_t i = 0U; i < 5U; i++)
    {
        if (!NETC_PortIsPseudo(handle->hw.ports[i].port) &&
            (0U == (handle->hw.ports[i].port->POR & (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK))))
        {
            NETC_PortEthMacGracefulStop(handle->hw.ports[i].port);
        }
    }
    SWT_RxBufferFreeAll(handle);

    return kStatus_Success;
}

status_t SWT_RxMirrorConfig(swt_handle_t *handle, const netc_swt_imr_config_t *config)
{
    assert((handle != NULL) && (config != NULL));

    handle->hw.base->IMDCR0 =
        NETC_SW_IMDCR0_PORT((kNETC_SWTMPort != config->destPort) ? (uint32_t)config->destPort : 0U) |
        NETC_SW_IMDCR0_DR(config->dr) | NETC_SW_IMDCR0_IPV(config->ipv) |
        NETC_SW_IMDCR0_MIRDEST((kNETC_SWTMPort == config->destPort) ? 1U : 0U) | NETC_SW_IMDCR0_MIREN(config->enMirror);
    if ((kNETC_SWTMPort == config->destPort) && (0xFFFFU != config->efmEntryID))
    {
        return kStatus_Fail;
    }
    else
    {
        handle->hw.base->IMDCR1 =
            NETC_SW_IMDCR1_EFM_LEN_CHANGE(config->efmLengthChange) | NETC_SW_IMDCR1_EFMEID(config->efmEntryID);
        return kStatus_Success;
    }
}

/*!
 * @brief Store necessary configuration constant in the handle
 *
 * @param handle  The SWT handle.
 * @param config  The user configuration.
 */
static void SWT_StoreTransConfig(swt_handle_t *handle, const swt_transfer_config_t *config)
{
    handle->cfg.rxCacheMaintain   = config->rxCacheMaintain;
    handle->cfg.txCacheMaintain   = config->txCacheMaintain;
    handle->cfg.rxZeroCopy        = config->rxZeroCopy;
    handle->cfg.rxBuffAlloc       = config->rxBuffAlloc;
    handle->cfg.rxBuffFree        = config->rxBuffFree;
    handle->cfg.enUseMgmtRxBdRing = config->enUseMgmtRxBdRing;
    handle->cfg.enUseMgmtTxBdRing = config->enUseMgmtTxBdRing;
    handle->cfg.reclaimCallback   = config->reclaimCallback;
    handle->cfg.userData          = config->userData;
}

status_t SWT_ManagementTxRxConfig(swt_handle_t *handle, ep_handle_t *epHandle, const swt_transfer_config_t *txRxConfig)
{
    assert((handle != NULL) && (epHandle != NULL) && (txRxConfig != NULL));

    const netc_rx_bdr_config_t *rxRingConfig;
    netc_rx_bd_t *rxDesc;
    uint64_t buffAddr;
    uint32_t buffIdx;

    handle->epHandle = epHandle;
    SWT_StoreTransConfig(handle, txRxConfig);
    if ((!NETC_EnetcHasManagement(epHandle->hw.base)) || (getSiNum(epHandle->cfg.si) != 0U))
    {
        /* Management frame only can be Tx/Rx on Switch management ENETC SI 0 */
        return kStatus_InvalidArgument;
    }
    if (txRxConfig->enUseMgmtRxBdRing)
    {
        rxRingConfig = &txRxConfig->mgmtRxBdrConfig;
        /* Get Management Rx ring hardware index */
        mgmtRxBdRingIdx = (uint8_t)(((epHandle->hw.base->NUM_SI[0].PSICFGR0 & NETC_ENETC_PSICFGR0_NUM_RX_BDR_MASK) >>
                                     NETC_ENETC_PSICFGR0_NUM_RX_BDR_SHIFT) -
                                    1U);
        if (NETC_SIConfigRxBDR(epHandle->hw.si, mgmtRxBdRingIdx, rxRingConfig) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->mgmtRxBdRing.extendDesc = rxRingConfig->extendDescEn;
        handle->mgmtRxBdRing.bdBase     = rxRingConfig->bdArray;
        handle->mgmtRxBdRing.len        = rxRingConfig->len;
        handle->mgmtRxBdRing.buffSize   = rxRingConfig->buffSize;
        /* Make all frames with the metadata field Host Reason set to non-zero are directed to this Management Rx ring
         */
        for (uint8_t i = 0U; i < NETC_ENETC_SMHRBDRMR_COUNT; i++)
        {
            epHandle->hw.base->SMHRBDRMR[i] = NETC_ENETC_SMHRBDRMR_RXBDR(mgmtRxBdRingIdx);
        }
        rxDesc = &rxRingConfig->bdArray[0];

        /* Store address information in the array in case the buffer address is lost due to Rx BD write-back. */
        handle->mgmtRxBdRing.buffArray = rxRingConfig->buffAddrArray;

        /* Initialize the buffers in Rx BD ring. */
        for (uint32_t index = 0U; index < rxRingConfig->len; index++)
        {
            /* Clear Rx BD before config the receive buffer start address */
            (void)memset(rxDesc, 0, sizeof(netc_rx_bd_t));

