JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.c
            /* When extended BD is enabled, two standard BDs represet one extended BD. Even number BD sets 0. */
            if (rxRingConfig->extendDescEn && (index % 2U != 0U))
            {
                rxDesc++;
                continue;
            }

            buffIdx = rxRingConfig->extendDescEn ? (index / 2U) : index;
            if (!txRxConfig->rxZeroCopy)
            {
                /* Get Rx buffer address from the address array provided by application. */
                buffAddr = handle->mgmtRxBdRing.buffArray[buffIdx];
            }
            else
            {
                /* Get Rx buffer address from the allocation function provided by application. */
                buffAddr =
                    (uintptr_t)(uint8_t *)txRxConfig->rxBuffAlloc(handle, rxRingConfig->buffSize, txRxConfig->userData);
                if (buffAddr == 0U)
                {
                    SWT_RxBufferFreeAll(handle);
                    return kStatus_NETC_LackOfResource;
                }

                /* Store address information in the array in case the buffer address can't find due to Rx BD
                 * write-back. */
                handle->mgmtRxBdRing.buffArray[buffIdx] = buffAddr;
            }

#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            buffAddr = MEMORY_ConvertMemoryMapAddress((uintptr_t)buffAddr, kMEMORY_Local2DMA);
#endif
            rxDesc->standard.addr = buffAddr;
            rxDesc++;
        }

        /* Enable the Rx BD ring. */
        NETC_SIRxRingEnable(epHandle->hw.si, mgmtRxBdRingIdx, true);
    }
    if (txRxConfig->enUseMgmtTxBdRing)
    {
        /* Management Tx ring only can be SI 0 ring 0 */
        if (NETC_SIConfigTxBDR(epHandle->hw.si, 0, &txRxConfig->mgmtTxBdrConfig) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->mgmtTxBdRing.bdBase    = txRxConfig->mgmtTxBdrConfig.bdArray;
        handle->mgmtTxBdRing.dirtyBase = txRxConfig->mgmtTxBdrConfig.dirtyArray;
        handle->mgmtTxBdRing.len       = txRxConfig->mgmtTxBdrConfig.len;
    }
    return kStatus_Success;
}

status_t SWT_SendFrame(swt_handle_t *handle,
                       swt_mgmt_tx_arg_t ringOrQueue,
                       netc_hw_port_idx_t swtPort,
                       bool enMasquerade,
                       netc_frame_struct_t *frame,
                       void *context,
                       swt_tx_opt *opt)
{
    netc_tx_bd_t txDesc[2] = {0};
    uint8_t hwRing;
    netc_tx_bdr_t *txBdRing;
    if (enMasquerade)
    {
        if (getSiNum(handle->epHandle->cfg.si) == 0U)
        {
            /* Switch management ENETC Tx BD hardware ring 0 can't be used to send port masqueradeque frame, so the
             * index need increase 1 */
            hwRing = ringOrQueue.ring + 1U;
        }
        else
        {
            hwRing = ringOrQueue.ring;
        }
        txDesc[0].standard.flags = NETC_SI_TXDESCRIP_RD_FLQ(2) | NETC_SI_TXDESCRIP_RD_PORT(swtPort);
        txBdRing                 = &handle->epHandle->txBdRing[ringOrQueue.ring];
    }
    else
    {
        if ((getSiNum(handle->epHandle->cfg.si) != 0U) || (!handle->cfg.enUseMgmtTxBdRing))
        {
            /* Direct switch enqueue frame only can be sent by Switch management ENETC SI 0 */
            return kStatus_InvalidArgument;
        }
        txDesc[0].standard.flags = NETC_SI_TXDESCRIP_RD_FLQ(2) | NETC_SI_TXDESCRIP_RD_SMSO_MASK |
                                   NETC_SI_TXDESCRIP_RD_PORT(swtPort) | NETC_SI_TXDESCRIP_RD_IPV(ringOrQueue.ipv) |
                                   NETC_SI_TXDESCRIP_RD_DR(ringOrQueue.dr);
        hwRing   = 0U;
        txBdRing = &handle->mgmtTxBdRing;
    }
    if (opt != NULL)
    {
        if (((opt->flags & (uint32_t)kSWT_TX_OPT_VLAN_INSERT) != 0U) && enMasquerade)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.pcp             = opt->vlan.pcp;
            txDesc[1].ext.dei             = opt->vlan.dei;
            txDesc[1].ext.vid             = opt->vlan.vid;
            txDesc[1].ext.tpid            = (uint16_t)opt->vlan.tpid;
            txDesc[1].ext.eFlags          = (uint8_t)kNETC_TxExtVlanInsert;
        }
        if (((opt->flags & (uint32_t)kSWT_TX_OPT_REQ_TS) != 0U) && enMasquerade)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.eFlags |= (uint8_t)kNETC_TxExtTwoStepTs;
        }
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
        if (((opt->flags & (uint32_t)kEP_TX_OPT_REQ_ONE_STEP_TS) != 0U) && enMasquerade)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.eFlags |= kNETC_TxExtOneStepTs;
        }
#endif
        if (((opt->flags & (uint32_t)kSWT_TX_OPT_DIRECT_ENQUEUE_REQ_TSR) != 0U) && (!enMasquerade))
        {
            txDesc[0].standard.flags |= NETC_SI_TXDESCRIP_RD_TSR_MASK;
        }
    }
    return EP_SendFrameCommon(handle->epHandle, txBdRing, hwRing, frame, context, &txDesc[0],
                              handle->cfg.txCacheMaintain);
}

void SWT_ReclaimTxDescriptor(swt_handle_t *handle, bool enMasquerade, uint8_t ring)
{
    netc_tx_frame_info_t *frameInfo;
    if (enMasquerade)
    {
        frameInfo = EP_ReclaimTxDescCommon(handle->epHandle, &handle->epHandle->txBdRing[ring], ring + 1U,
                                           (handle->epHandle->cfg.reclaimCallback != NULL));
    }
    else
    {
        frameInfo =
            EP_ReclaimTxDescCommon(handle->epHandle, &handle->mgmtTxBdRing, 0, (handle->cfg.reclaimCallback != NULL));
    }
    if (frameInfo != NULL)
    {
        if (enMasquerade)
        {
            /* Port masquerade still use ep transfer handle */
            (void)handle->epHandle->cfg.reclaimCallback(handle->epHandle, ring, frameInfo,
                                                        handle->epHandle->cfg.userData);
        }
        else
        {
            (void)handle->cfg.reclaimCallback(handle, frameInfo, handle->cfg.userData);
        }
        (void)memset(frameInfo, 0, sizeof(netc_tx_frame_info_t));
    }
}

status_t SWT_GetRxFrameSize(swt_handle_t *handle, uint32_t *length)
{
    assert((handle != NULL) && (length != NULL));
    netc_rx_bdr_t *rxBdRing = NULL;
    status_t result;

