JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.c
    return status;
}

status_t SWT_GetSBPEntryState(swt_handle_t *handle, uint32_t entryID, netc_tb_sbp_sbpse_t *state)
{
    assert(handle != NULL);

    uint32_t entryNumMax = (handle->hw.base->BPCAPR & NETC_SW_BPCAPR_NUM_SPB_MASK) >> NETC_SW_BPCAPR_NUM_SPB_SHIFT;
    status_t status      = kStatus_NETC_LackOfResource;
    netc_cmd_bd_t cmdBd  = {0};
    netc_cbdr_handle_t cdbrHandle;

    if (entryID >= entryNumMax)
    {
        return kStatus_InvalidArgument;
    }

    if (SWT_GetIdleCmdBDRing(handle, &cdbrHandle) == kStatus_Success)
    {
        cdbrHandle.buffer->sbp.request.entryID                    = entryID;
        cdbrHandle.buffer->sbp.request.commonHeader.updateActions = 0;
        cdbrHandle.buffer->sbp.request.commonHeader.queryActions  = 0;
        cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                       = 8U;
        cmdBd.req.resLength                                       = sizeof(netc_tb_sbp_rsp_data_t);
        cmdBd.req.tableId                                         = kNETC_SBPTable;
        cmdBd.req.cmd                                             = kNETC_QueryEntry;
        cmdBd.req.accessType                                      = kNETC_EntryIDMatch;
        status = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (status == kStatus_Success)
        {
            *state = cdbrHandle.buffer->sbp.response.sbpse;
        }
    }

    return status;
}
